# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)

# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

first = int(input ("Введите начальное число диапазона: "))
second = int(input ("Введите конечное число диапазона: "))

for i in range(len(list)):
    if first<=list[i]<= second:
        print(i, end=' ')



# list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# list_1=[]
# first = int(input ("Введите начальное число диапазона: "))
# second = int(input ("Введите конечное число диапазона: "))

# for i in range(len(list)):
#     if first<=list[i]<= second:
#         list_1.append(i)
        
# print(list_1)
